MikroElektronika/core_packages/PIC/XC8/def/PIC16F1947/mcu.h
// Register: PORTF
#define PORTF PORTF
extern volatile unsigned char           PORTF               __at(0x28C);
#ifndef _LIB_BUILD
asm("PORTF equ 028Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF0                    :1;
        unsigned RF1                    :1;
        unsigned RF2                    :1;
        unsigned RF3                    :1;
        unsigned RF4                    :1;
        unsigned RF5                    :1;
        unsigned RF6                    :1;
        unsigned RF7                    :1;
    };
    struct {
        unsigned AN16                   :1;
        unsigned AN6                    :1;
        unsigned AN7                    :1;
        unsigned AN8                    :1;
        unsigned AN9                    :1;
        unsigned AN10                   :1;
        unsigned AN11                   :1;
        unsigned AN5                    :1;
    };
    struct {
        unsigned SEG41                  :1;
        unsigned SEG19                  :1;
        unsigned SEG20                  :1;
        unsigned SEG21                  :1;
        unsigned SEG22                  :1;
        unsigned SEG23                  :1;
        unsigned SEG24                  :1;
        unsigned SEG25                  :1;
    };
    struct {
        unsigned CPS16                  :1;
        unsigned CPS6                   :1;
        unsigned CPS7                   :1;
        unsigned CPS8                   :1;
        unsigned CPS9                   :1;
        unsigned CPS10                  :1;
        unsigned CPS11                  :1;
        unsigned CPS5                   :1;
    };
    struct {
        unsigned C1IN0N                 :1;
        unsigned C2OUT                  :1;
        unsigned C1OUT                  :1;
        unsigned C1IN2N                 :1;
        unsigned C2INP                  :1;
        unsigned C1IN1N                 :1;
        unsigned C1INP                  :1;
        unsigned C1IN3N                 :1;
    };
    struct {
        unsigned C2IN0N                 :1;
        unsigned SRNQ                   :1;
        unsigned SRQ                    :1;
        unsigned C2IN2N                 :1;
        unsigned                        :1;
        unsigned C2IN1N                 :1;
        unsigned                        :1;
        unsigned C2IN3N                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned C3IN2N                 :1;
        unsigned                        :1;
        unsigned DACOUT                 :1;
        unsigned                        :1;
        unsigned C3IN3N                 :1;
    };
} PORTFbits_t;
extern volatile PORTFbits_t PORTFbits __at(0x28C);
// bitfield macros
#define _PORTF_RF0_POSN                                     0x0
#define _PORTF_RF0_POSITION                                 0x0
#define _PORTF_RF0_SIZE                                     0x1
#define _PORTF_RF0_LENGTH                                   0x1
#define _PORTF_RF0_MASK                                     0x1
#define _PORTF_RF1_POSN                                     0x1
#define _PORTF_RF1_POSITION                                 0x1
#define _PORTF_RF1_SIZE                                     0x1
#define _PORTF_RF1_LENGTH                                   0x1
#define _PORTF_RF1_MASK                                     0x2
#define _PORTF_RF2_POSN                                     0x2
#define _PORTF_RF2_POSITION                                 0x2
#define _PORTF_RF2_SIZE                                     0x1
#define _PORTF_RF2_LENGTH                                   0x1
#define _PORTF_RF2_MASK                                     0x4
#define _PORTF_RF3_POSN                                     0x3
#define _PORTF_RF3_POSITION                                 0x3
#define _PORTF_RF3_SIZE                                     0x1
#define _PORTF_RF3_LENGTH                                   0x1
#define _PORTF_RF3_MASK                                     0x8
#define _PORTF_RF4_POSN                                     0x4
#define _PORTF_RF4_POSITION                                 0x4
#define _PORTF_RF4_SIZE                                     0x1
#define _PORTF_RF4_LENGTH                                   0x1
#define _PORTF_RF4_MASK                                     0x10
#define _PORTF_RF5_POSN                                     0x5
#define _PORTF_RF5_POSITION                                 0x5
#define _PORTF_RF5_SIZE                                     0x1
#define _PORTF_RF5_LENGTH                                   0x1
#define _PORTF_RF5_MASK                                     0x20
#define _PORTF_RF6_POSN                                     0x6
#define _PORTF_RF6_POSITION                                 0x6
#define _PORTF_RF6_SIZE                                     0x1
#define _PORTF_RF6_LENGTH                                   0x1
#define _PORTF_RF6_MASK                                     0x40
#define _PORTF_RF7_POSN                                     0x7
#define _PORTF_RF7_POSITION                                 0x7
#define _PORTF_RF7_SIZE                                     0x1
#define _PORTF_RF7_LENGTH                                   0x1
#define _PORTF_RF7_MASK                                     0x80
#define _PORTF_AN16_POSN                                    0x0
#define _PORTF_AN16_POSITION                                0x0
#define _PORTF_AN16_SIZE                                    0x1
#define _PORTF_AN16_LENGTH                                  0x1
#define _PORTF_AN16_MASK                                    0x1
#define _PORTF_AN6_POSN                                     0x1
#define _PORTF_AN6_POSITION                                 0x1
#define _PORTF_AN6_SIZE                                     0x1
#define _PORTF_AN6_LENGTH                                   0x1
#define _PORTF_AN6_MASK                                     0x2
#define _PORTF_AN7_POSN                                     0x2
#define _PORTF_AN7_POSITION                                 0x2
#define _PORTF_AN7_SIZE                                     0x1
#define _PORTF_AN7_LENGTH                                   0x1
#define _PORTF_AN7_MASK                                     0x4
#define _PORTF_AN8_POSN                                     0x3
#define _PORTF_AN8_POSITION                                 0x3
#define _PORTF_AN8_SIZE                                     0x1
#define _PORTF_AN8_LENGTH                                   0x1
#define _PORTF_AN8_MASK                                     0x8
#define _PORTF_AN9_POSN                                     0x4
#define _PORTF_AN9_POSITION                                 0x4
#define _PORTF_AN9_SIZE                                     0x1
#define _PORTF_AN9_LENGTH                                   0x1
#define _PORTF_AN9_MASK                                     0x10
#define _PORTF_AN10_POSN                                    0x5
#define _PORTF_AN10_POSITION                                0x5
#define _PORTF_AN10_SIZE                                    0x1
#define _PORTF_AN10_LENGTH                                  0x1
#define _PORTF_AN10_MASK                                    0x20
#define _PORTF_AN11_POSN                                    0x6
#define _PORTF_AN11_POSITION                                0x6
#define _PORTF_AN11_SIZE                                    0x1
#define _PORTF_AN11_LENGTH                                  0x1
#define _PORTF_AN11_MASK                                    0x40
#define _PORTF_AN5_POSN                                     0x7
#define _PORTF_AN5_POSITION                                 0x7
#define _PORTF_AN5_SIZE                                     0x1
#define _PORTF_AN5_LENGTH                                   0x1
#define _PORTF_AN5_MASK                                     0x80
#define _PORTF_SEG41_POSN                                   0x0
#define _PORTF_SEG41_POSITION                               0x0
#define _PORTF_SEG41_SIZE                                   0x1
#define _PORTF_SEG41_LENGTH                                 0x1
#define _PORTF_SEG41_MASK                                   0x1
#define _PORTF_SEG19_POSN                                   0x1
#define _PORTF_SEG19_POSITION                               0x1
#define _PORTF_SEG19_SIZE                                   0x1
#define _PORTF_SEG19_LENGTH                                 0x1
#define _PORTF_SEG19_MASK                                   0x2
#define _PORTF_SEG20_POSN                                   0x2
#define _PORTF_SEG20_POSITION                               0x2
#define _PORTF_SEG20_SIZE                                   0x1
#define _PORTF_SEG20_LENGTH                                 0x1
#define _PORTF_SEG20_MASK                                   0x4
#define _PORTF_SEG21_POSN                                   0x3
#define _PORTF_SEG21_POSITION                               0x3
#define _PORTF_SEG21_SIZE                                   0x1
#define _PORTF_SEG21_LENGTH                                 0x1
#define _PORTF_SEG21_MASK                                   0x8
#define _PORTF_SEG22_POSN                                   0x4
#define _PORTF_SEG22_POSITION                               0x4
#define _PORTF_SEG22_SIZE                                   0x1
#define _PORTF_SEG22_LENGTH                                 0x1
#define _PORTF_SEG22_MASK                                   0x10
#define _PORTF_SEG23_POSN                                   0x5
#define _PORTF_SEG23_POSITION                               0x5
#define _PORTF_SEG23_SIZE                                   0x1
#define _PORTF_SEG23_LENGTH                                 0x1
#define _PORTF_SEG23_MASK                                   0x20
#define _PORTF_SEG24_POSN                                   0x6
#define _PORTF_SEG24_POSITION                               0x6
#define _PORTF_SEG24_SIZE                                   0x1
#define _PORTF_SEG24_LENGTH                                 0x1
#define _PORTF_SEG24_MASK                                   0x40
#define _PORTF_SEG25_POSN                                   0x7
#define _PORTF_SEG25_POSITION                               0x7
#define _PORTF_SEG25_SIZE                                   0x1
#define _PORTF_SEG25_LENGTH                                 0x1
#define _PORTF_SEG25_MASK                                   0x80
#define _PORTF_CPS16_POSN                                   0x0
#define _PORTF_CPS16_POSITION                               0x0
#define _PORTF_CPS16_SIZE                                   0x1
#define _PORTF_CPS16_LENGTH                                 0x1
#define _PORTF_CPS16_MASK                                   0x1
#define _PORTF_CPS6_POSN                                    0x1
#define _PORTF_CPS6_POSITION                                0x1
#define _PORTF_CPS6_SIZE                                    0x1
#define _PORTF_CPS6_LENGTH                                  0x1
#define _PORTF_CPS6_MASK                                    0x2
#define _PORTF_CPS7_POSN                                    0x2
#define _PORTF_CPS7_POSITION                                0x2
#define _PORTF_CPS7_SIZE                                    0x1
#define _PORTF_CPS7_LENGTH                                  0x1
#define _PORTF_CPS7_MASK                                    0x4
#define _PORTF_CPS8_POSN                                    0x3
#define _PORTF_CPS8_POSITION                                0x3
#define _PORTF_CPS8_SIZE                                    0x1
#define _PORTF_CPS8_LENGTH                                  0x1
#define _PORTF_CPS8_MASK                                    0x8
#define _PORTF_CPS9_POSN                                    0x4
#define _PORTF_CPS9_POSITION                                0x4
#define _PORTF_CPS9_SIZE                                    0x1
#define _PORTF_CPS9_LENGTH                                  0x1
#define _PORTF_CPS9_MASK                                    0x10
#define _PORTF_CPS10_POSN                                   0x5
#define _PORTF_CPS10_POSITION                               0x5
#define _PORTF_CPS10_SIZE                                   0x1
#define _PORTF_CPS10_LENGTH                                 0x1
#define _PORTF_CPS10_MASK                                   0x20
#define _PORTF_CPS11_POSN                                   0x6
#define _PORTF_CPS11_POSITION                               0x6
#define _PORTF_CPS11_SIZE                                   0x1
#define _PORTF_CPS11_LENGTH                                 0x1
#define _PORTF_CPS11_MASK                                   0x40
#define _PORTF_CPS5_POSN                                    0x7
#define _PORTF_CPS5_POSITION                                0x7
#define _PORTF_CPS5_SIZE                                    0x1
#define _PORTF_CPS5_LENGTH                                  0x1
#define _PORTF_CPS5_MASK                                    0x80
#define _PORTF_C1IN0N_POSN                                  0x0
#define _PORTF_C1IN0N_POSITION                              0x0
#define _PORTF_C1IN0N_SIZE                                  0x1
#define _PORTF_C1IN0N_LENGTH                                0x1
#define _PORTF_C1IN0N_MASK                                  0x1
#define _PORTF_C2OUT_POSN                                   0x1
#define _PORTF_C2OUT_POSITION                               0x1
#define _PORTF_C2OUT_SIZE                                   0x1
#define _PORTF_C2OUT_LENGTH                                 0x1
#define _PORTF_C2OUT_MASK                                   0x2
#define _PORTF_C1OUT_POSN                                   0x2
#define _PORTF_C1OUT_POSITION                               0x2
#define _PORTF_C1OUT_SIZE                                   0x1
#define _PORTF_C1OUT_LENGTH                                 0x1
#define _PORTF_C1OUT_MASK                                   0x4
#define _PORTF_C1IN2N_POSN                                  0x3
#define _PORTF_C1IN2N_POSITION                              0x3
#define _PORTF_C1IN2N_SIZE                                  0x1
#define _PORTF_C1IN2N_LENGTH                                0x1
#define _PORTF_C1IN2N_MASK                                  0x8
#define _PORTF_C2INP_POSN                                   0x4
#define _PORTF_C2INP_POSITION                               0x4
#define _PORTF_C2INP_SIZE                                   0x1
#define _PORTF_C2INP_LENGTH                                 0x1
#define _PORTF_C2INP_MASK                                   0x10
#define _PORTF_C1IN1N_POSN                                  0x5
#define _PORTF_C1IN1N_POSITION                              0x5
#define _PORTF_C1IN1N_SIZE                                  0x1
#define _PORTF_C1IN1N_LENGTH                                0x1
#define _PORTF_C1IN1N_MASK                                  0x20
#define _PORTF_C1INP_POSN                                   0x6
#define _PORTF_C1INP_POSITION                               0x6
#define _PORTF_C1INP_SIZE                                   0x1
#define _PORTF_C1INP_LENGTH                                 0x1
#define _PORTF_C1INP_MASK                                   0x40
#define _PORTF_C1IN3N_POSN                                  0x7
#define _PORTF_C1IN3N_POSITION                              0x7
#define _PORTF_C1IN3N_SIZE                                  0x1
#define _PORTF_C1IN3N_LENGTH                                0x1
#define _PORTF_C1IN3N_MASK                                  0x80
#define _PORTF_C2IN0N_POSN                                  0x0
#define _PORTF_C2IN0N_POSITION                              0x0
#define _PORTF_C2IN0N_SIZE                                  0x1
#define _PORTF_C2IN0N_LENGTH                                0x1
#define _PORTF_C2IN0N_MASK                                  0x1
#define _PORTF_SRNQ_POSN                                    0x1
#define _PORTF_SRNQ_POSITION                                0x1
#define _PORTF_SRNQ_SIZE                                    0x1
#define _PORTF_SRNQ_LENGTH                                  0x1
#define _PORTF_SRNQ_MASK                                    0x2
#define _PORTF_SRQ_POSN                                     0x2
#define _PORTF_SRQ_POSITION                                 0x2
#define _PORTF_SRQ_SIZE                                     0x1
#define _PORTF_SRQ_LENGTH                                   0x1
#define _PORTF_SRQ_MASK                                     0x4
#define _PORTF_C2IN2N_POSN                                  0x3
#define _PORTF_C2IN2N_POSITION                              0x3
#define _PORTF_C2IN2N_SIZE                                  0x1
#define _PORTF_C2IN2N_LENGTH                                0x1
#define _PORTF_C2IN2N_MASK                                  0x8
#define _PORTF_C2IN1N_POSN                                  0x5
#define _PORTF_C2IN1N_POSITION                              0x5
#define _PORTF_C2IN1N_SIZE                                  0x1
#define _PORTF_C2IN1N_LENGTH                                0x1
#define _PORTF_C2IN1N_MASK                                  0x20
#define _PORTF_C2IN3N_POSN                                  0x7
#define _PORTF_C2IN3N_POSITION                              0x7
#define _PORTF_C2IN3N_SIZE                                  0x1
#define _PORTF_C2IN3N_LENGTH                                0x1
#define _PORTF_C2IN3N_MASK                                  0x80
#define _PORTF_C3IN2N_POSN                                  0x3
#define _PORTF_C3IN2N_POSITION                              0x3
#define _PORTF_C3IN2N_SIZE                                  0x1
#define _PORTF_C3IN2N_LENGTH                                0x1
#define _PORTF_C3IN2N_MASK                                  0x8
#define _PORTF_DACOUT_POSN                                  0x5
#define _PORTF_DACOUT_POSITION                              0x5
#define _PORTF_DACOUT_SIZE                                  0x1
#define _PORTF_DACOUT_LENGTH                                0x1
#define _PORTF_DACOUT_MASK                                  0x20
#define _PORTF_C3IN3N_POSN                                  0x7
#define _PORTF_C3IN3N_POSITION                              0x7
#define _PORTF_C3IN3N_SIZE                                  0x1
#define _PORTF_C3IN3N_LENGTH                                0x1
#define _PORTF_C3IN3N_MASK                                  0x80

// Register: PORTG
#define PORTG PORTG
extern volatile unsigned char           PORTG               __at(0x28D);
#ifndef _LIB_BUILD
asm("PORTG equ 028Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG0                    :1;
        unsigned RG1                    :1;
        unsigned RG2                    :1;
        unsigned RG3                    :1;
        unsigned RG4                    :1;
        unsigned RG5                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned AN15                   :1;
        unsigned AN14                   :1;
        unsigned AN13                   :1;
        unsigned AN12                   :1;
        unsigned nMCLR                  :1;
    };
    struct {
        unsigned SEG42                  :1;
        unsigned SEG43                  :1;
        unsigned SEG44                  :1;
        unsigned SEG45                  :1;
        unsigned SEG26                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned CPS15                  :1;
        unsigned CPS14                  :1;
        unsigned CPS13                  :1;
        unsigned CPS12                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned C3OUT                  :1;
        unsigned C3INP                  :1;
        unsigned C3IN0N                 :1;
        unsigned C3IN1N                 :1;
    };
    struct {
        unsigned CCP3                   :1;
        unsigned TX2                    :1;
        unsigned RX2                    :1;
        unsigned CCP4                   :1;
        unsigned CCP5                   :1;
    };
    struct {
        unsigned P3A                    :1;
        unsigned CK2                    :1;
        unsigned DT2                    :1;
        unsigned P3D                    :1;
        unsigned P1D                    :1;
    };
} PORTGbits_t;
