MikroElektronika/core_packages/PIC/XC8/def/PIC16F1947/mcu.h
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// ADCON1<ADCS0>
extern volatile __bit                   ADCS0               __at(0x4F4);	// @ (0x9E * 8 + 4)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<ADCS1>
extern volatile __bit                   ADCS1               __at(0x4F5);	// @ (0x9E * 8 + 5)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON1,5)
// ADCON1<ADCS2>
extern volatile __bit                   ADCS2               __at(0x4F6);	// @ (0x9E * 8 + 6)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON1,6)
// ADCON1<ADFM>
extern volatile __bit                   ADFM                __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON1,7)
// FVRCON<ADFVR0>
extern volatile __bit                   ADFVR0              __at(0x8B8);	// @ (0x117 * 8 + 0)
#define                                 ADFVR0_bit          _BIT_ACCESS(FVRCON,0)
// FVRCON<ADFVR1>
extern volatile __bit                   ADFVR1              __at(0x8B9);	// @ (0x117 * 8 + 1)
#define                                 ADFVR1_bit          _BIT_ACCESS(FVRCON,1)
// ADCON0<ADGO>
extern volatile __bit                   ADGO                __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 ADGO_bit            _BIT_ACCESS(ADCON0,1)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x8E);	// @ (0x11 * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// ADCON1<ADNREF>
extern volatile __bit                   ADNREF              __at(0x4F2);	// @ (0x9E * 8 + 2)
#define                                 ADNREF_bit          _BIT_ACCESS(ADCON1,2)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ADCON1<ADPREF0>
extern volatile __bit                   ADPREF0             __at(0x4F0);	// @ (0x9E * 8 + 0)
#define                                 ADPREF0_bit         _BIT_ACCESS(ADCON1,0)
// ADCON1<ADPREF1>
extern volatile __bit                   ADPREF1             __at(0x4F1);	// @ (0x9E * 8 + 1)
#define                                 ADPREF1_bit         _BIT_ACCESS(ADCON1,1)
// PORTA<AN0>
extern volatile __bit                   AN0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 AN0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<AN1>
extern volatile __bit                   AN1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 AN1_bit             _BIT_ACCESS(PORTA,1)
// PORTF<AN10>
extern volatile __bit                   AN10                __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 AN10_bit            _BIT_ACCESS(PORTF,5)
// PORTF<AN11>
extern volatile __bit                   AN11                __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 AN11_bit            _BIT_ACCESS(PORTF,6)
// PORTG<AN12>
extern volatile __bit                   AN12                __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 AN12_bit            _BIT_ACCESS(PORTG,4)
// PORTG<AN13>
extern volatile __bit                   AN13                __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 AN13_bit            _BIT_ACCESS(PORTG,3)
// PORTG<AN14>
extern volatile __bit                   AN14                __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 AN14_bit            _BIT_ACCESS(PORTG,2)
// PORTG<AN15>
extern volatile __bit                   AN15                __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 AN15_bit            _BIT_ACCESS(PORTG,1)
// PORTF<AN16>
extern volatile __bit                   AN16                __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 AN16_bit            _BIT_ACCESS(PORTF,0)
// PORTA<AN2>
extern volatile __bit                   AN2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 AN2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<AN3>
extern volatile __bit                   AN3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 AN3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<AN4>
extern volatile __bit                   AN4                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 AN4_bit             _BIT_ACCESS(PORTA,5)
// PORTF<AN5>
extern volatile __bit                   AN5                 __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 AN5_bit             _BIT_ACCESS(PORTF,7)
// PORTF<AN6>
extern volatile __bit                   AN6                 __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 AN6_bit             _BIT_ACCESS(PORTF,1)
// PORTF<AN7>
extern volatile __bit                   AN7                 __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 AN7_bit             _BIT_ACCESS(PORTF,2)
// PORTF<AN8>
extern volatile __bit                   AN8                 __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 AN8_bit             _BIT_ACCESS(PORTF,3)
// PORTF<AN9>
extern volatile __bit                   AN9                 __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 AN9_bit             _BIT_ACCESS(PORTF,4)
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0xC60);	// @ (0x18C * 8 + 0)
#define                                 ANSA0_bit           _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0xC61);	// @ (0x18C * 8 + 1)
#define                                 ANSA1_bit           _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0xC62);	// @ (0x18C * 8 + 2)
#define                                 ANSA2_bit           _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSA3>
extern volatile __bit                   ANSA3               __at(0xC63);	// @ (0x18C * 8 + 3)
#define                                 ANSA3_bit           _BIT_ACCESS(ANSELA,3)
// ANSELA<ANSA5>
extern volatile __bit                   ANSA5               __at(0xC65);	// @ (0x18C * 8 + 5)
#define                                 ANSA5_bit           _BIT_ACCESS(ANSELA,5)
// ANSELE<ANSE0>
extern volatile __bit                   ANSE0               __at(0xC80);	// @ (0x190 * 8 + 0)
#define                                 ANSE0_bit           _BIT_ACCESS(ANSELE,0)
// ANSELE<ANSE1>
extern volatile __bit                   ANSE1               __at(0xC81);	// @ (0x190 * 8 + 1)
#define                                 ANSE1_bit           _BIT_ACCESS(ANSELE,1)
// ANSELE<ANSE2>
extern volatile __bit                   ANSE2               __at(0xC82);	// @ (0x190 * 8 + 2)
#define                                 ANSE2_bit           _BIT_ACCESS(ANSELE,2)
// ANSELF<ANSF0>
extern volatile __bit                   ANSF0               __at(0x2060);	// @ (0x40C * 8 + 0)
#define                                 ANSF0_bit           _BIT_ACCESS(ANSELF,0)
// ANSELF<ANSF1>
extern volatile __bit                   ANSF1               __at(0x2061);	// @ (0x40C * 8 + 1)
#define                                 ANSF1_bit           _BIT_ACCESS(ANSELF,1)
// ANSELF<ANSF2>
extern volatile __bit                   ANSF2               __at(0x2062);	// @ (0x40C * 8 + 2)
#define                                 ANSF2_bit           _BIT_ACCESS(ANSELF,2)
// ANSELF<ANSF3>
extern volatile __bit                   ANSF3               __at(0x2063);	// @ (0x40C * 8 + 3)
#define                                 ANSF3_bit           _BIT_ACCESS(ANSELF,3)
// ANSELF<ANSF4>
extern volatile __bit                   ANSF4               __at(0x2064);	// @ (0x40C * 8 + 4)
#define                                 ANSF4_bit           _BIT_ACCESS(ANSELF,4)
// ANSELF<ANSF5>
extern volatile __bit                   ANSF5               __at(0x2065);	// @ (0x40C * 8 + 5)
#define                                 ANSF5_bit           _BIT_ACCESS(ANSELF,5)
// ANSELF<ANSF6>
extern volatile __bit                   ANSF6               __at(0x2066);	// @ (0x40C * 8 + 6)
#define                                 ANSF6_bit           _BIT_ACCESS(ANSELF,6)
// ANSELF<ANSF7>
extern volatile __bit                   ANSF7               __at(0x2067);	// @ (0x40C * 8 + 7)
#define                                 ANSF7_bit           _BIT_ACCESS(ANSELF,7)
// ANSELG<ANSG1>
extern volatile __bit                   ANSG1               __at(0x2069);	// @ (0x40D * 8 + 1)
#define                                 ANSG1_bit           _BIT_ACCESS(ANSELG,1)
// ANSELG<ANSG2>
extern volatile __bit                   ANSG2               __at(0x206A);	// @ (0x40D * 8 + 2)
#define                                 ANSG2_bit           _BIT_ACCESS(ANSELG,2)
// ANSELG<ANSG3>
extern volatile __bit                   ANSG3               __at(0x206B);	// @ (0x40D * 8 + 3)
#define                                 ANSG3_bit           _BIT_ACCESS(ANSELG,3)
// ANSELG<ANSG4>
extern volatile __bit                   ANSG4               __at(0x206C);	// @ (0x40D * 8 + 4)
#define                                 ANSG4_bit           _BIT_ACCESS(ANSELG,4)
// PIE4<BCL2IE>
extern volatile __bit                   BCL2IE              __at(0x4A1);	// @ (0x94 * 8 + 1)
#define                                 BCL2IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<BCL2IF>
extern volatile __bit                   BCL2IF              __at(0xA1);	// @ (0x14 * 8 + 1)
#define                                 BCL2IF_bit          _BIT_ACCESS(PIR4,1)
// PIE2<BCLIE>
extern volatile __bit                   BCLIE               __at(0x493);	// @ (0x92 * 8 + 3)
#define                                 BCLIE_bit           _BIT_ACCESS(PIE2,3)
// PIR2<BCLIF>
extern volatile __bit                   BCLIF               __at(0x93);	// @ (0x12 * 8 + 3)
#define                                 BCLIF_bit           _BIT_ACCESS(PIR2,3)
// LCDPS<BIASMD>
extern volatile __bit                   BIASMD              __at(0x3C96);	// @ (0x792 * 8 + 6)
#define                                 BIASMD_bit          _BIT_ACCESS(LCDPS,6)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x8B0);	// @ (0x116 * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// BSR<BSR0>
extern volatile __bit                   BSR0                __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 BSR0_bit            _BIT_ACCESS(BSR,0)
// BSR<BSR1>
extern volatile __bit                   BSR1                __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 BSR1_bit            _BIT_ACCESS(BSR,1)
// BSR<BSR2>
extern volatile __bit                   BSR2                __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 BSR2_bit            _BIT_ACCESS(BSR,2)
// BSR<BSR3>
extern volatile __bit                   BSR3                __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 BSR3_bit            _BIT_ACCESS(BSR,3)
// BSR<BSR4>
extern volatile __bit                   BSR4                __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 BSR4_bit            _BIT_ACCESS(BSR,4)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x495);	// @ (0x92 * 8 + 5)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,5)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x95);	// @ (0x12 * 8 + 5)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,5)
// PORTF<C1IN0N>
extern volatile __bit                   C1IN0N              __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 C1IN0N_bit          _BIT_ACCESS(PORTF,0)
// PORTF<C1IN1N>
extern volatile __bit                   C1IN1N              __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 C1IN1N_bit          _BIT_ACCESS(PORTF,5)
// PORTF<C1IN2N>
extern volatile __bit                   C1IN2N              __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 C1IN2N_bit          _BIT_ACCESS(PORTF,3)
// PORTF<C1IN3N>
extern volatile __bit                   C1IN3N              __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 C1IN3N_bit          _BIT_ACCESS(PORTF,7)
// PORTF<C1INP>
extern volatile __bit                   C1INP               __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 C1INP_bit           _BIT_ACCESS(PORTF,6)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x896);	// @ (0x112 * 8 + 6)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,6)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x897);	// @ (0x112 * 8 + 7)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,7)
// CM1CON1<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x890);	// @ (0x112 * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1CON1,1)
// CM1CON0<C1OE>
extern volatile __bit                   C1OE                __at(0x88D);	// @ (0x111 * 8 + 5)
#define                                 C1OE_bit            _BIT_ACCESS(CM1CON0,5)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x88F);	// @ (0x111 * 8 + 7)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON1<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x894);	// @ (0x112 * 8 + 4)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1CON1,4)
// CM1CON1<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x895);	// @ (0x112 * 8 + 5)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1CON1,5)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SP>
extern volatile __bit                   C1SP                __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 C1SP_bit            _BIT_ACCESS(CM1CON0,2)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CCPTMRS0<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x14F0);	// @ (0x29E * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS0,0)
// CCPTMRS0<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x14F1);	// @ (0x29E * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS0,1)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x899);	// @ (0x113 * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x496);	// @ (0x92 * 8 + 6)
#define                                 C2IE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x96);	// @ (0x12 * 8 + 6)
#define                                 C2IF_bit            _BIT_ACCESS(PIR2,6)
// PORTF<C2IN0N>
extern volatile __bit                   C2IN0N              __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 C2IN0N_bit          _BIT_ACCESS(PORTF,0)
// PORTF<C2IN1N>
extern volatile __bit                   C2IN1N              __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 C2IN1N_bit          _BIT_ACCESS(PORTF,5)
// PORTF<C2IN2N>
extern volatile __bit                   C2IN2N              __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 C2IN2N_bit          _BIT_ACCESS(PORTF,3)
// PORTF<C2IN3N>
extern volatile __bit                   C2IN3N              __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 C2IN3N_bit          _BIT_ACCESS(PORTF,7)
// PORTF<C2INP>
extern volatile __bit                   C2INP               __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 C2INP_bit           _BIT_ACCESS(PORTF,4)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x8A6);	// @ (0x114 * 8 + 6)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,6)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x8A7);	// @ (0x114 * 8 + 7)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,7)
// CM2CON1<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x8A0);	// @ (0x114 * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON1<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x8A1);	// @ (0x114 * 8 + 1)
#define                                 C2NCH1_bit          _BIT_ACCESS(CM2CON1,1)
// CM2CON0<C2OE>
extern volatile __bit                   C2OE                __at(0x89D);	// @ (0x113 * 8 + 5)
#define                                 C2OE_bit            _BIT_ACCESS(CM2CON0,5)
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x89F);	// @ (0x113 * 8 + 7)
#define                                 C2ON_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON1<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x8A4);	// @ (0x114 * 8 + 4)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2CON1,4)
// CM2CON1<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x8A5);	// @ (0x114 * 8 + 5)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2CON1,5)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x89C);	// @ (0x113 * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2SP>
extern volatile __bit                   C2SP                __at(0x89A);	// @ (0x113 * 8 + 2)
#define                                 C2SP_bit            _BIT_ACCESS(CM2CON0,2)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x898);	// @ (0x113 * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// CCPTMRS0<C2TSEL0>
extern volatile __bit                   C2TSEL0             __at(0x14F2);	// @ (0x29E * 8 + 2)
#define                                 C2TSEL0_bit         _BIT_ACCESS(CCPTMRS0,2)
// CCPTMRS0<C2TSEL1>
extern volatile __bit                   C2TSEL1             __at(0x14F3);	// @ (0x29E * 8 + 3)
#define                                 C2TSEL1_bit         _BIT_ACCESS(CCPTMRS0,3)
// CM3CON0<C3HYS>
extern volatile __bit                   C3HYS               __at(0x8F1);	// @ (0x11E * 8 + 1)
#define                                 C3HYS_bit           _BIT_ACCESS(CM3CON0,1)
// PIE2<C3IE>
extern volatile __bit                   C3IE                __at(0x491);	// @ (0x92 * 8 + 1)
#define                                 C3IE_bit            _BIT_ACCESS(PIE2,1)
// PIR2<C3IF>
extern volatile __bit                   C3IF                __at(0x91);	// @ (0x12 * 8 + 1)
#define                                 C3IF_bit            _BIT_ACCESS(PIR2,1)
// PORTG<C3IN0N>
extern volatile __bit                   C3IN0N              __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 C3IN0N_bit          _BIT_ACCESS(PORTG,3)
// PORTG<C3IN1N>
extern volatile __bit                   C3IN1N              __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 C3IN1N_bit          _BIT_ACCESS(PORTG,4)
// PORTF<C3IN2N>
extern volatile __bit                   C3IN2N              __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 C3IN2N_bit          _BIT_ACCESS(PORTF,3)
// PORTF<C3IN3N>
extern volatile __bit                   C3IN3N              __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 C3IN3N_bit          _BIT_ACCESS(PORTF,7)
// PORTG<C3INP>
extern volatile __bit                   C3INP               __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 C3INP_bit           _BIT_ACCESS(PORTG,2)
// CM3CON1<C3INTN>
extern volatile __bit                   C3INTN              __at(0x8FE);	// @ (0x11F * 8 + 6)
#define                                 C3INTN_bit          _BIT_ACCESS(CM3CON1,6)
// CM3CON1<C3INTP>
extern volatile __bit                   C3INTP              __at(0x8FF);	// @ (0x11F * 8 + 7)
#define                                 C3INTP_bit          _BIT_ACCESS(CM3CON1,7)
// CM3CON1<C3NCH0>
extern volatile __bit                   C3NCH0              __at(0x8F8);	// @ (0x11F * 8 + 0)
#define                                 C3NCH0_bit          _BIT_ACCESS(CM3CON1,0)
// CM3CON1<C3NCH1>
extern volatile __bit                   C3NCH1              __at(0x8F9);	// @ (0x11F * 8 + 1)
#define                                 C3NCH1_bit          _BIT_ACCESS(CM3CON1,1)
// CM3CON0<C3OE>
extern volatile __bit                   C3OE                __at(0x8F5);	// @ (0x11E * 8 + 5)
#define                                 C3OE_bit            _BIT_ACCESS(CM3CON0,5)
// CM3CON0<C3ON>
extern volatile __bit                   C3ON                __at(0x8F7);	// @ (0x11E * 8 + 7)
#define                                 C3ON_bit            _BIT_ACCESS(CM3CON0,7)
// CM3CON1<C3PCH0>
extern volatile __bit                   C3PCH0              __at(0x8FC);	// @ (0x11F * 8 + 4)
#define                                 C3PCH0_bit          _BIT_ACCESS(CM3CON1,4)
// CM3CON1<C3PCH1>
extern volatile __bit                   C3PCH1              __at(0x8FD);	// @ (0x11F * 8 + 5)
#define                                 C3PCH1_bit          _BIT_ACCESS(CM3CON1,5)
// CM3CON0<C3POL>
extern volatile __bit                   C3POL               __at(0x8F4);	// @ (0x11E * 8 + 4)
#define                                 C3POL_bit           _BIT_ACCESS(CM3CON0,4)
// CM3CON0<C3SP>
extern volatile __bit                   C3SP                __at(0x8F2);	// @ (0x11E * 8 + 2)
#define                                 C3SP_bit            _BIT_ACCESS(CM3CON0,2)
// CM3CON0<C3SYNC>
extern volatile __bit                   C3SYNC              __at(0x8F0);	// @ (0x11E * 8 + 0)
#define                                 C3SYNC_bit          _BIT_ACCESS(CM3CON0,0)
// CCPTMRS0<C3TSEL0>
extern volatile __bit                   C3TSEL0             __at(0x14F4);	// @ (0x29E * 8 + 4)
#define                                 C3TSEL0_bit         _BIT_ACCESS(CCPTMRS0,4)
// CCPTMRS0<C3TSEL1>
