MikroElektronika/core_packages/PIC/XC8/def/PIC16F1947/mcu.h
extern volatile __bit                   LRLAT2              __at(0x3CAA);	// @ (0x795 * 8 + 2)
#define                                 LRLAT2_bit          _BIT_ACCESS(LCDRL,2)
// LCDRL<LRLBP0>
extern volatile __bit                   LRLBP0              __at(0x3CAC);	// @ (0x795 * 8 + 4)
#define                                 LRLBP0_bit          _BIT_ACCESS(LCDRL,4)
// LCDRL<LRLBP1>
extern volatile __bit                   LRLBP1              __at(0x3CAD);	// @ (0x795 * 8 + 5)
#define                                 LRLBP1_bit          _BIT_ACCESS(LCDRL,5)
// EECON1<LWLO>
extern volatile __bit                   LWLO                __at(0xCAD);	// @ (0x195 * 8 + 5)
#define                                 LWLO_bit            _BIT_ACCESS(EECON1,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// CMOUT<MC3OUT>
extern volatile __bit                   MC3OUT              __at(0x8AA);	// @ (0x115 * 8 + 2)
#define                                 MC3OUT_bit          _BIT_ACCESS(CMOUT,2)
// OSCSTAT<MFIOFR>
extern volatile __bit                   MFIOFR              __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 MFIOFR_bit          _BIT_ACCESS(OSCSTAT,2)
// PORTA<OSC1>
extern volatile __bit                   OSC1                __at(0x67);	// @ (0xC * 8 + 7)
#define                                 OSC1_bit            _BIT_ACCESS(PORTA,7)
// PORTA<OSC2>
extern volatile __bit                   OSC2                __at(0x66);	// @ (0xC * 8 + 6)
#define                                 OSC2_bit            _BIT_ACCESS(PORTA,6)
// PIE2<OSFIE>
extern volatile __bit                   OSFIE               __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x97);	// @ (0x12 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// OSCSTAT<OSTS>
extern volatile __bit                   OSTS                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 OSTS_bit            _BIT_ACCESS(OSCSTAT,5)
// PORTC<P1A>
extern volatile __bit                   P1A                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 P1A_bit             _BIT_ACCESS(PORTC,2)
// APFCON<P1BSEL>
extern volatile __bit                   P1BSEL              __at(0x8E8);	// @ (0x11D * 8 + 0)
#define                                 P1BSEL_bit          _BIT_ACCESS(APFCON,0)
// APFCON<P1CSEL>
extern volatile __bit                   P1CSEL              __at(0x8E9);	// @ (0x11D * 8 + 1)
#define                                 P1CSEL_bit          _BIT_ACCESS(APFCON,1)
// PORTG<P1D>
extern volatile __bit                   P1D                 __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 P1D_bit             _BIT_ACCESS(PORTG,4)
// PWM1CON<P1DC0>
extern volatile __bit                   P1DC0               __at(0x14A0);	// @ (0x294 * 8 + 0)
#define                                 P1DC0_bit           _BIT_ACCESS(PWM1CON,0)
// PWM1CON<P1DC1>
extern volatile __bit                   P1DC1               __at(0x14A1);	// @ (0x294 * 8 + 1)
#define                                 P1DC1_bit           _BIT_ACCESS(PWM1CON,1)
// PWM1CON<P1DC2>
extern volatile __bit                   P1DC2               __at(0x14A2);	// @ (0x294 * 8 + 2)
#define                                 P1DC2_bit           _BIT_ACCESS(PWM1CON,2)
// PWM1CON<P1DC3>
extern volatile __bit                   P1DC3               __at(0x14A3);	// @ (0x294 * 8 + 3)
#define                                 P1DC3_bit           _BIT_ACCESS(PWM1CON,3)
// PWM1CON<P1DC4>
extern volatile __bit                   P1DC4               __at(0x14A4);	// @ (0x294 * 8 + 4)
#define                                 P1DC4_bit           _BIT_ACCESS(PWM1CON,4)
// PWM1CON<P1DC5>
extern volatile __bit                   P1DC5               __at(0x14A5);	// @ (0x294 * 8 + 5)
#define                                 P1DC5_bit           _BIT_ACCESS(PWM1CON,5)
// PWM1CON<P1DC6>
extern volatile __bit                   P1DC6               __at(0x14A6);	// @ (0x294 * 8 + 6)
#define                                 P1DC6_bit           _BIT_ACCESS(PWM1CON,6)
// CCP1CON<P1M0>
extern volatile __bit                   P1M0                __at(0x149E);	// @ (0x293 * 8 + 6)
#define                                 P1M0_bit            _BIT_ACCESS(CCP1CON,6)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x149F);	// @ (0x293 * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// PWM1CON<P1RSEN>
extern volatile __bit                   P1RSEN              __at(0x14A7);	// @ (0x294 * 8 + 7)
#define                                 P1RSEN_bit          _BIT_ACCESS(PWM1CON,7)
// APFCON<P2BSEL>
extern volatile __bit                   P2BSEL              __at(0x8EB);	// @ (0x11D * 8 + 3)
#define                                 P2BSEL_bit          _BIT_ACCESS(APFCON,3)
// APFCON<P2CSEL>
extern volatile __bit                   P2CSEL              __at(0x8EC);	// @ (0x11D * 8 + 4)
#define                                 P2CSEL_bit          _BIT_ACCESS(APFCON,4)
// PWM2CON<P2DC0>
extern volatile __bit                   P2DC0               __at(0x14D8);	// @ (0x29B * 8 + 0)
#define                                 P2DC0_bit           _BIT_ACCESS(PWM2CON,0)
// PWM2CON<P2DC1>
extern volatile __bit                   P2DC1               __at(0x14D9);	// @ (0x29B * 8 + 1)
#define                                 P2DC1_bit           _BIT_ACCESS(PWM2CON,1)
// PWM2CON<P2DC2>
extern volatile __bit                   P2DC2               __at(0x14DA);	// @ (0x29B * 8 + 2)
#define                                 P2DC2_bit           _BIT_ACCESS(PWM2CON,2)
// PWM2CON<P2DC3>
extern volatile __bit                   P2DC3               __at(0x14DB);	// @ (0x29B * 8 + 3)
#define                                 P2DC3_bit           _BIT_ACCESS(PWM2CON,3)
// PWM2CON<P2DC4>
extern volatile __bit                   P2DC4               __at(0x14DC);	// @ (0x29B * 8 + 4)
#define                                 P2DC4_bit           _BIT_ACCESS(PWM2CON,4)
// PWM2CON<P2DC5>
extern volatile __bit                   P2DC5               __at(0x14DD);	// @ (0x29B * 8 + 5)
#define                                 P2DC5_bit           _BIT_ACCESS(PWM2CON,5)
// PWM2CON<P2DC6>
extern volatile __bit                   P2DC6               __at(0x14DE);	// @ (0x29B * 8 + 6)
#define                                 P2DC6_bit           _BIT_ACCESS(PWM2CON,6)
// APFCON<P2DSEL>
extern volatile __bit                   P2DSEL              __at(0x8ED);	// @ (0x11D * 8 + 5)
#define                                 P2DSEL_bit          _BIT_ACCESS(APFCON,5)
// CCP2CON<P2M0>
extern volatile __bit                   P2M0                __at(0x14D6);	// @ (0x29A * 8 + 6)
#define                                 P2M0_bit            _BIT_ACCESS(CCP2CON,6)
// CCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x14D7);	// @ (0x29A * 8 + 7)
#define                                 P2M1_bit            _BIT_ACCESS(CCP2CON,7)
// PWM2CON<P2RSEN>
extern volatile __bit                   P2RSEN              __at(0x14DF);	// @ (0x29B * 8 + 7)
#define                                 P2RSEN_bit          _BIT_ACCESS(PWM2CON,7)
// PORTG<P3A>
extern volatile __bit                   P3A                 __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 P3A_bit             _BIT_ACCESS(PORTG,0)
// APFCON<P3BSEL>
extern volatile __bit                   P3BSEL              __at(0x8EE);	// @ (0x11D * 8 + 6)
#define                                 P3BSEL_bit          _BIT_ACCESS(APFCON,6)
// APFCON<P3CSEL>
extern volatile __bit                   P3CSEL              __at(0x8EF);	// @ (0x11D * 8 + 7)
#define                                 P3CSEL_bit          _BIT_ACCESS(APFCON,7)
// PORTG<P3D>
extern volatile __bit                   P3D                 __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 P3D_bit             _BIT_ACCESS(PORTG,3)
// PWM3CON<P3DC0>
extern volatile __bit                   P3DC0               __at(0x18A0);	// @ (0x314 * 8 + 0)
#define                                 P3DC0_bit           _BIT_ACCESS(PWM3CON,0)
// PWM3CON<P3DC1>
extern volatile __bit                   P3DC1               __at(0x18A1);	// @ (0x314 * 8 + 1)
#define                                 P3DC1_bit           _BIT_ACCESS(PWM3CON,1)
// PWM3CON<P3DC2>
extern volatile __bit                   P3DC2               __at(0x18A2);	// @ (0x314 * 8 + 2)
#define                                 P3DC2_bit           _BIT_ACCESS(PWM3CON,2)
// PWM3CON<P3DC3>
extern volatile __bit                   P3DC3               __at(0x18A3);	// @ (0x314 * 8 + 3)
#define                                 P3DC3_bit           _BIT_ACCESS(PWM3CON,3)
// PWM3CON<P3DC4>
extern volatile __bit                   P3DC4               __at(0x18A4);	// @ (0x314 * 8 + 4)
#define                                 P3DC4_bit           _BIT_ACCESS(PWM3CON,4)
// PWM3CON<P3DC5>
extern volatile __bit                   P3DC5               __at(0x18A5);	// @ (0x314 * 8 + 5)
#define                                 P3DC5_bit           _BIT_ACCESS(PWM3CON,5)
// PWM3CON<P3DC6>
extern volatile __bit                   P3DC6               __at(0x18A6);	// @ (0x314 * 8 + 6)
#define                                 P3DC6_bit           _BIT_ACCESS(PWM3CON,6)
// CCP3CON<P3M0>
extern volatile __bit                   P3M0                __at(0x189E);	// @ (0x313 * 8 + 6)
#define                                 P3M0_bit            _BIT_ACCESS(CCP3CON,6)
// CCP3CON<P3M1>
extern volatile __bit                   P3M1                __at(0x189F);	// @ (0x313 * 8 + 7)
#define                                 P3M1_bit            _BIT_ACCESS(CCP3CON,7)
// PWM3CON<P3RSEN>
extern volatile __bit                   P3RSEN              __at(0x18A7);	// @ (0x314 * 8 + 7)
#define                                 P3RSEN_bit          _BIT_ACCESS(PWM3CON,7)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,6)
// OPTION_REG<PS0>
extern volatile __bit                   _PS0                 __at(0x4A8);	// @ (0x95 * 8 + 0)  // Note: Changed by MikroE
#define                                 PS0_bit             _BIT_ACCESS(OPTION_REG,0)
// OPTION_REG<PS1>
extern volatile __bit                   _PS1                 __at(0x4A9);	// @ (0x95 * 8 + 1)  // Note: Changed by MikroE
#define                                 PS1_bit             _BIT_ACCESS(OPTION_REG,1)
// OPTION_REG<PS2>
extern volatile __bit                   _PS2                 __at(0x4AA);	// @ (0x95 * 8 + 2)  // Note: Changed by MikroE
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x4AB);	// @ (0x95 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// CCP1AS<PSS1AC0>
extern volatile __bit                   PSS1AC0             __at(0x14AA);	// @ (0x295 * 8 + 2)
#define                                 PSS1AC0_bit         _BIT_ACCESS(CCP1AS,2)
// CCP1AS<PSS1AC1>
extern volatile __bit                   PSS1AC1             __at(0x14AB);	// @ (0x295 * 8 + 3)
#define                                 PSS1AC1_bit         _BIT_ACCESS(CCP1AS,3)
// CCP1AS<PSS1BD0>
extern volatile __bit                   PSS1BD0             __at(0x14A8);	// @ (0x295 * 8 + 0)
#define                                 PSS1BD0_bit         _BIT_ACCESS(CCP1AS,0)
// CCP1AS<PSS1BD1>
extern volatile __bit                   PSS1BD1             __at(0x14A9);	// @ (0x295 * 8 + 1)
#define                                 PSS1BD1_bit         _BIT_ACCESS(CCP1AS,1)
// CCP2AS<PSS2AC0>
extern volatile __bit                   PSS2AC0             __at(0x14E2);	// @ (0x29C * 8 + 2)
#define                                 PSS2AC0_bit         _BIT_ACCESS(CCP2AS,2)
// CCP2AS<PSS2AC1>
extern volatile __bit                   PSS2AC1             __at(0x14E3);	// @ (0x29C * 8 + 3)
#define                                 PSS2AC1_bit         _BIT_ACCESS(CCP2AS,3)
// CCP2AS<PSS2BD0>
extern volatile __bit                   PSS2BD0             __at(0x14E0);	// @ (0x29C * 8 + 0)
#define                                 PSS2BD0_bit         _BIT_ACCESS(CCP2AS,0)
// CCP2AS<PSS2BD1>
extern volatile __bit                   PSS2BD1             __at(0x14E1);	// @ (0x29C * 8 + 1)
#define                                 PSS2BD1_bit         _BIT_ACCESS(CCP2AS,1)
// CCP3AS<PSS3AC0>
extern volatile __bit                   PSS3AC0             __at(0x18AA);	// @ (0x315 * 8 + 2)
#define                                 PSS3AC0_bit         _BIT_ACCESS(CCP3AS,2)
// CCP3AS<PSS3AC1>
extern volatile __bit                   PSS3AC1             __at(0x18AB);	// @ (0x315 * 8 + 3)
#define                                 PSS3AC1_bit         _BIT_ACCESS(CCP3AS,3)
// CCP3AS<PSS3BD0>
extern volatile __bit                   PSS3BD0             __at(0x18A8);	// @ (0x315 * 8 + 0)
#define                                 PSS3BD0_bit         _BIT_ACCESS(CCP3AS,0)
// CCP3AS<PSS3BD1>
extern volatile __bit                   PSS3BD1             __at(0x18A9);	// @ (0x315 * 8 + 1)
#define                                 PSS3BD1_bit         _BIT_ACCESS(CCP3AS,1)
// PWM1CON<PWM1RSEN>
extern volatile __bit                   PWM1RSEN            __at(0x14A7);	// @ (0x294 * 8 + 7)
#define                                 PWM1RSEN_bit        _BIT_ACCESS(PWM1CON,7)
// PWM2CON<PWM2RSEN>
extern volatile __bit                   PWM2RSEN            __at(0x14DF);	// @ (0x29B * 8 + 7)
#define                                 PWM2RSEN_bit        _BIT_ACCESS(PWM2CON,7)
// PWM3CON<PWM3RSEN>
extern volatile __bit                   PWM3RSEN            __at(0x18A7);	// @ (0x314 * 8 + 7)
#define                                 PWM3RSEN_bit        _BIT_ACCESS(PWM3CON,7)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x66);	// @ (0xC * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x67);	// @ (0xC * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x68);	// @ (0xD * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x69);	// @ (0xD * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x6A);	// @ (0xD * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x6B);	// @ (0xD * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PIE1<RC1IE>
extern volatile __bit                   RC1IE               __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 RC1IE_bit           _BIT_ACCESS(PIE1,5)
// PIR1<RC1IF>
extern volatile __bit                   RC1IF               __at(0x8D);	// @ (0x11 * 8 + 5)
#define                                 RC1IF_bit           _BIT_ACCESS(PIR1,5)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PIE4<RC2IE>
extern volatile __bit                   RC2IE               __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 RC2IE_bit           _BIT_ACCESS(PIE4,5)
// PIR4<RC2IF>
extern volatile __bit                   RC2IF               __at(0xA5);	// @ (0x14 * 8 + 5)
#define                                 RC2IF_bit           _BIT_ACCESS(PIR4,5)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x73);	// @ (0xE * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x76);	// @ (0xE * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x77);	// @ (0xE * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x8D);	// @ (0x11 * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// EECON1<RD>
extern volatile __bit                   RD                  __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(EECON1,0)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x78);	// @ (0xF * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x79);	// @ (0xF * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x7A);	// @ (0xF * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x7B);	// @ (0xF * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x7C);	// @ (0xF * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x7D);	// @ (0xF * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x7E);	// @ (0xF * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x7F);	// @ (0xF * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x80);	// @ (0x10 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x81);	// @ (0x10 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x82);	// @ (0x10 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// PORTE<RE4>
extern volatile __bit                   RE4                 __at(0x84);	// @ (0x10 * 8 + 4)
#define                                 RE4_bit             _BIT_ACCESS(PORTE,4)
// PORTE<RE5>
extern volatile __bit                   RE5                 __at(0x85);	// @ (0x10 * 8 + 5)
#define                                 RE5_bit             _BIT_ACCESS(PORTE,5)
// PORTE<RE6>
extern volatile __bit                   RE6                 __at(0x86);	// @ (0x10 * 8 + 6)
#define                                 RE6_bit             _BIT_ACCESS(PORTE,6)
// PORTE<RE7>
extern volatile __bit                   RE7                 __at(0x87);	// @ (0x10 * 8 + 7)
#define                                 RE7_bit             _BIT_ACCESS(PORTE,7)
// PORTF<RF0>
extern volatile __bit                   RF0                 __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 RF0_bit             _BIT_ACCESS(PORTF,0)
// PORTF<RF1>
extern volatile __bit                   RF1                 __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 RF1_bit             _BIT_ACCESS(PORTF,1)
// PORTF<RF2>
extern volatile __bit                   RF2                 __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 RF2_bit             _BIT_ACCESS(PORTF,2)
